package Easy;

public class Questions {

    /*

    1. Протокол - набор правил, которые должны поддерживать устройства,
        для возможности передачи данных друг другу.
    TCP/IP - это стандарт интерфейсов стека-протоколов,
        для обеспечения совместимости между разными устройствами.
    Клиент-серверное приложение - приложение, написанное по клиент-серверной архитекруте.
        Клиент -> Сервер (Получает запрос, обрабатывает), (Отправляет ответ) Сервер -> Клиент.
    Rest - подход к созданию веб-приложений, основанный на http и url.
    SOAP - другой подход к созданию веб-приложений (устарел), основан на XML,
        а также использует специальный протокол SOAP.
    HTTP - набор правил, по которым клиент и сервер обмениваются данными,
        например обмениваются запросами, или HTML страничками.

    2. Уровни в модели TCP/IP - Прикладной (HTTP, DNS), Транспортный (TCP, UPD),
        Интернет-уровень (IP), Сетевой (Wi-Fi, Ethernet).

    3. TCP - файл при отправке (например) разбивает на множество пакетов и после отправляется,
        сервер ждёт получения ВСЕХ пакетов и только после собирает файл воедино.
    UDP - сервер не ждёт получения всех пакетов.
        Например, видео звонок: картинка иногда может зависать, как и звук, как раз по этой причине.

    4. Метод GET - запрос получения объекта или информации о нём,
        POST - создание объекта, например тело json объекта, PUT - обновляет информацию в теле объекта,
        DELETE - удаляет объект.

    5. Да, использовать PUT-запрос для создания объекта мы можем, потому что метод сам по себе говорит:
        "Заменить ресурс целиком по-данному URL данными из тела запроса", и если такого ресурса не будет,
        то он создастся.

     */

}
